comsys/uri.html
---
layout: page
title: Uniform Resource Identifier
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Aufbau</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>scheme ":" hierarchical-part ["?" query] ["#" fragment]</code>
</p>

<ul class="org-ul">
<li>Schema: legt die Interpretation des folgenden Teils fest, z.B. <code>http</code>,
<code>ftp</code>, <code>doi</code>
</li>
<li>hierarchical part: ="//" [Benutzerinformation "@"] [authority] "/" path=
<ul class="org-ul">
<li>Benutzerinformation (sollte nicht mehr verwendet werden, da URIs
als Klartext übertragen werden)
</li>
<li><b>authority</b>, z.B. angegeben durch <code>host:port</code>
</li>
<li><b>path</b>
</li>
</ul>
</li>
<li>query: ermöglicht zusätzliche parametrisierung des Identifiers
</li>
<li>fragment: identifiziert eine Stelle innerhalb einer Ressource
</li>
</ul>
</div>
</div>
